app/helpers/sessions_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    if (user_id = session[:user_id])# notice "=" is not a comparism sign, the whole statement could be read as If session of user id exists (while setting user id to session of user id)
      @current_user ||= User.find_by(id: user_id)
    elsif (user_id = cookies.signed[:user_id])
      user = User.find_by(id: user_id)