app/controllers/microposts_controller.rb

  def index
		@micropost = Micropost.paginate(page: params[:page])
---
SELECT  "microposts".* FROM "microposts" ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 11], ["OFFSET", 0]]